# https://homebrew-file.readthedocs.io/en/latest/usage.html

# $ brew file set_repo -r LEI/dot-osw
# ~/.config/brewfile/Brewfile

# cask_args appdir: "/Applications"

brew "cmake" # make, automake, autoconf
brew "coreutils"
brew "curl" , args: ["with-openssl"] # --with-nghttp2 # KEEP
# brew "binutils"
brew "diffutils"
brew "findutils" , args: ["with-default-names"]
# Install GNU `sed`, overwriting the built-in `sed`
brew "gnu-sed" , args: ["with-default-names"]
brew "gnutls" # KEEP
brew "grep" , args: ["with-default-names"]
brew "imagemagick" , args: ["with-webp"] # graphicsmagick
# brew "lua"
# brew "luajit"
# brew "mas" # Mac App Store CLI
brew "moreutils"
# brew "mosh"
brew "nmap"
brew "openssh"
brew "openssl" # KEEP
# brew "pandoc"
# brew "pass" # pwgen
brew "patchutils"
# brew "rename"
# brew "rsync"
# brew "syncthing" # ipfs
brew "the_silver_searcher" # ripgrep, fd
#brew "the-unarchiver" # p7zip
brew "trash" # rmtrash, debian: trash-cli
brew "wget" , args: ["with-iri"] # KEEP
brew "youtube-dl"

# # Completions
# brew "brew-cask-completion"
# brew "docker-completion"
# brew "pip-completion"
# brew "vagrant-completion"

# cask "bettertouchtool"
cask "bitwarden"
# cask "dropbox"
cask "filezilla"
cask "firefox"
cask "caskroom/fonts/font-hack"
# cask "gimp"
cask "google-chrome" # brewcanary
# cask "scroll-reverser"
cask "little-snitch"
# cask "opera"
# cask "robomongo"
# cask "sequel-pro"
# cask "skype"
# cask "slack"
# cask "steam"
# cask "torbrowser"
cask "transmission"
# cask "transmit" # transmit4
# cask "tunnelbear"
# cask "vagrant"
# cask "virtualbox" # Fails on Travis CI
# cask "vlc"

# tap homebrew/cask
# install brew-cask

# cask "firefox", args: { appdir: "~/Applications" }
# cask "inkscape"

# mas "Xcode", id: 497799835
